public/programming/linux/linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../programming.html">Programming</a> &gt;
</p>

<div id="outline-container-org2cd0ec8" class="outline-2">
<h2 id="org2cd0ec8">Linux</h2>
<div class="outline-text-2" id="text-org2cd0ec8">
<p>
In high school I participated in a cybersecurity course and played
CTFs, this was a big step up in my learning journey. I began using
Kali <a href="interjection.html">Linux</a> for the competitions, I then continued to use Linux
daily. I installed Arch Linux manually for the first time on
summer 2021.
</p>

<p>
I wanted to be like the cool nerds at <a href="https://www.reddit.com/r/unixporn/top/?t=all">r/unixporn</a> so I went the route
of insane ricing and configuration of obscure command line tools just
to look cool.  I was using <a href="https://github.com/San7o/nixos-dotfiles">NixOS</a>, of course, with all the trendy
software like kitty and other stupid crap.
</p>

<p>
I got frustrated with NixOS since It felt like a jail, so I removed
everything and I setup the most minimal system I could work on. During
this period I was getting passionate about kernel development, I
wrote a few kernel modules and I started writing my own operating
system. I was using my self compiled <a href="linux-from-scratch.html">linux from scratch</a>, for many
months I did not have a graphics sessions or a browser on my only
computer.
</p>

<p>
I started following the linux kernel development mailing lists and
many others. Pushing in this direction led me to an internship about
writing eBPF programs for a <a href="../kubernetes/kubernetes.html">kubernetes</a> cluster which got me into cloud
computing.
</p>

<p>
&#x2013; <a href="notes.html">notes</a> -
</p>

<hr />

<p>
Travel: <a href="../programming.html">Programming</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
